//  Copyright © 2023 ChefKiss Inc. Licensed under the Thou Shalt Not Profit License version 1.0. See LICENSE for
//  details.

#ifndef kern_gen11_hpp
#define kern_gen11_hpp
#include "kern_nblue.hpp"
#include "Firmware.hpp"
#include "kern_patcherplus.hpp"
#include <Headers/kern_util.hpp>



typedef __signed__ char __s8;
typedef unsigned char __u8;

typedef __signed__ short __s16;
typedef unsigned short __u16;

typedef __signed__ int __s32;
typedef unsigned int __u32;
__extension__ typedef __signed__ long long __s64;
__extension__ typedef unsigned long long __u64;

typedef __s8  s8;
typedef __u8  u8;
typedef __s16 s16;
typedef __u16 u16;
typedef __s32 s32;
typedef __u32 u32;
typedef __s64 s64;
typedef __u64 u64;


#define MTL_MEDIA_GSI_BASE		0x380000
#define GMD_ID_MEDIA				(MTL_MEDIA_GSI_BASE + 0xd8c)
#define GMD_ID_GRAPHICS				(0xd8c)

#define   GMD_ID_ARCH_MASK			REG_GENMASK(31, 22)
#define   GMD_ID_RELEASE_MASK			REG_GENMASK(21, 14)
#define   GMD_ID_STEP				REG_GENMASK(5, 0)
struct intel_ip_version {
	u8 ver;
	u8 rel;
	u8 step;
};
struct intel_step_info {
	/*
	 * It is expected to have 4 number steps per letter. Deviation from
	 * the expectation breaks gmd_to_intel_step().
	 */
	u8 graphics_step;	/* Represents the compute tile on Xe_HPC */
	u8 media_step;
};
#define I915_GEM_PPGTT_NONE	0
#define I915_GEM_PPGTT_ALIASING	1
#define I915_GEM_PPGTT_FULL	2
enum intel_ppgtt_type {
	INTEL_PPGTT_NONE = I915_GEM_PPGTT_NONE,
	INTEL_PPGTT_ALIASING = I915_GEM_PPGTT_ALIASING,
	INTEL_PPGTT_FULL = I915_GEM_PPGTT_FULL,
};
struct intel_runtime_info {
	/*
	 * Single "graphics" IP version that represents
	 * render, compute and copy behavior.
	 */
	struct {
		struct intel_ip_version ip;
	} graphics;
	struct {
		struct intel_ip_version ip;
	} media;

	/*
	 * Platform mask is used for optimizing or-ed IS_PLATFORM calls into
	 * single runtime conditionals, and also to provide groundwork for
	 * future per platform, or per SKU build optimizations.
	 *
	 * Array can be extended when necessary if the corresponding
	 * BUILD_BUG_ON is hit.
	 */
	u32 platform_mask[2];

	u16 device_id;

	struct intel_step_info step;

	unsigned int page_sizes; /* page sizes supported by the HW */

	enum intel_ppgtt_type ppgtt_type;
	unsigned int ppgtt_size; /* log2, e.g. 31/32/48 bits */

	bool has_pooled_eu;
};




#define BIT(n) (1<< n)
#define REG_BIT(n) (1<< n)
#define   RING_FORCE_TO_NONPRIV_ACCESS_RW	(0 << 28)
#define __MASKED_FIELD(mask, value) ((mask) << 16 | (value))
#define _MASKED_FIELD(mask, value) ({ __MASKED_FIELD(mask, value); })
#define _MASKED_BIT_ENABLE(a)	({ __typeof(a) _a = (a); _MASKED_FIELD(_a, _a); })
#define _MASKED_BIT_DISABLE(a)	(_MASKED_FIELD((a), 0))

enum phy {
	PHY_NONE = -1,

	PHY_A = 0,
	PHY_B,
	PHY_C,
	PHY_D,
	PHY_E,
	PHY_F,
	PHY_G,
	PHY_H,
	PHY_I,

	I915_MAX_PHYS
};
enum {
	PROCMON_0_85V_DOT_0,
	PROCMON_0_95V_DOT_0,
	PROCMON_0_95V_DOT_1,
	PROCMON_1_05V_DOT_0,
	PROCMON_1_05V_DOT_1,
};

#define for_each_dbuf_slice(slice_mask, __slice) \
	for ((__slice) = DBUF_S1; (__slice) < I915_MAX_DBUF_SLICES; (__slice)++) \
		for_each_if(slice_mask & BIT(__slice))

#define for_each_if(condition) if (!(condition)) {} else

#define for_each_combo_phy(__display, __phy) \
for ((__phy) = PHY_A; (__phy) < I915_MAX_PHYS; (__phy)++)	\
	for_each_if(intel_phy_is_combo(__display, __phy))

static const struct icl_procmon {
	const char *name;
	uint32_t dw1, dw9, dw10;
} icl_procmon_values[] = {
	[PROCMON_0_85V_DOT_0] = {
		.name = "0.85V dot0 (low-voltage)",
		.dw1 = 0x00000000, .dw9 = 0x62AB67BB, .dw10 = 0x51914F96,
	},
	[PROCMON_0_95V_DOT_0] = {
		.name = "0.95V dot0",
		.dw1 = 0x00000000, .dw9 = 0x86E172C7, .dw10 = 0x77CA5EAB,
	},
	[PROCMON_0_95V_DOT_1] = {
		.name = "0.95V dot1",
		.dw1 = 0x00000000, .dw9 = 0x93F87FE1, .dw10 = 0x8AE871C5,
	},
	[PROCMON_1_05V_DOT_0] = {
		.name = "1.05V dot0",
		.dw1 = 0x00000000, .dw9 = 0x98FA82DD, .dw10 = 0x89E46DC1,
	},
	[PROCMON_1_05V_DOT_1] = {
		.name = "1.05V dot1",
		.dw1 = 0x00440000, .dw9 = 0x9A00AB25, .dw10 = 0x8AE38FF1,
	},
};


#define _PORT(port, a, b)		_PICK_EVEN(port, a, b)
#define _MMIO(r) (r)
#define _MMIO_PORT(port, a, b)		_MMIO(_PORT(port, a, b))
#define   PROCESS_INFO_MASK			REG_GENMASK(28, 26)
#define   PROCESS_INFO_DOT_0			REG_FIELD_PREP(PROCESS_INFO_MASK, 0)
#define   PROCESS_INFO_DOT_1			REG_FIELD_PREP(PROCESS_INFO_MASK, 1)
#define   PROCESS_INFO_DOT_4			REG_FIELD_PREP(PROCESS_INFO_MASK, 2)
#define   VOLTAGE_INFO_MASK			REG_GENMASK(25, 24)
#define   VOLTAGE_INFO_0_85V			REG_FIELD_PREP(VOLTAGE_INFO_MASK, 0)
#define   VOLTAGE_INFO_0_95V			REG_FIELD_PREP(VOLTAGE_INFO_MASK, 1)
#define   VOLTAGE_INFO_1_05V			REG_FIELD_PREP(VOLTAGE_INFO_MASK, 2)
#define _ICL_COMBOPHY_A				0x162000
#define _ICL_COMBOPHY_B				0x6C000
#define _EHL_COMBOPHY_C				0x160000
#define _RKL_COMBOPHY_D				0x161000
#define _ADL_COMBOPHY_E				0x16B000
#define _PICK(__index, ...) (((const uint32_t []){ __VA_ARGS__ })[__index])
#define _ICL_COMBOPHY(phy)			_PICK(phy, _ICL_COMBOPHY_A, \
						  _ICL_COMBOPHY_B, \
						  _EHL_COMBOPHY_C, \
						  _RKL_COMBOPHY_D, \
						  _ADL_COMBOPHY_E)
#define _ICL_PORT_COMP				0x100
#define _ICL_PORT_COMP_DW(dw, phy)		(_ICL_COMBOPHY(phy) + \
					 _ICL_PORT_COMP + 4 * (dw))
#define ICL_PORT_COMP_DW1(phy)			_MMIO(_ICL_PORT_COMP_DW(1, phy))
#define ICL_PORT_COMP_DW3(phy)			_MMIO(_ICL_PORT_COMP_DW(3, phy))

#define _ICL_PHY_MISC_A		0x64C00
#define _ICL_PHY_MISC_B		0x64C04
#define _DG2_PHY_MISC_TC1	0x64C14 /* TC1="PHY E" but offset as if "PHY F" */
#define ICL_PHY_MISC(port)	_MMIO_PORT(port, _ICL_PHY_MISC_A, _ICL_PHY_MISC_B)
#define  ICL_PHY_MISC_MUX_DDID			(1 << 28)
#define  ICL_PHY_MISC_DE_IO_COMP_PWR_DOWN	(1 << 23)
#define   ICL_PORT_TX_DW8_ODCC_CLK_DIV_SEL_MASK	REG_GENMASK(30, 29)
#define ICL_PORT_TX_DW8_AUX(phy)		_MMIO(_ICL_PORT_TX_DW_AUX(8, phy))
#define ICL_PORT_TX_DW8_GRP(phy)		_MMIO(_ICL_PORT_TX_DW_GRP(8, phy))
#define ICL_PORT_TX_DW8_LN(ln, phy)		_MMIO(_ICL_PORT_TX_DW_LN(8, ln, phy))
#define   ICL_PORT_TX_DW8_ODCC_CLK_SEL		REG_BIT(31)
#define   ICL_PORT_TX_DW8_ODCC_CLK_DIV_SEL_MASK	REG_GENMASK(30, 29)
#define   ICL_PORT_TX_DW8_ODCC_CLK_DIV_SEL_DIV2	REG_FIELD_PREP(ICL_PORT_TX_DW8_ODCC_CLK_DIV_SEL_MASK, 0x1)
#define ICL_PORT_PCS_DW1_LN(ln, phy)		_MMIO(_ICL_PORT_PCS_DW_LN(1, ln, phy))
#define   DCC_MODE_SELECT_MASK			REG_GENMASK(21, 20)
#define   RUN_DCC_ONCE				REG_FIELD_PREP(DCC_MODE_SELECT_MASK, 0)
#define ICL_PORT_COMP_DW8(phy)			_MMIO(_ICL_PORT_COMP_DW(8, phy))
#define ICL_PORT_PCS_DW1_GRP(phy)		_MMIO(_ICL_PORT_PCS_DW_GRP(1, phy))
#define ICL_PORT_COMP_DW0(phy)			_MMIO(_ICL_PORT_COMP_DW(0, phy))
#define ICL_PORT_CL_DW5(phy)			_MMIO(_ICL_PORT_CL_DW(5, phy))
#define   CL_POWER_DOWN_ENABLE			REG_BIT(4)
#define _ICL_PORT_TX_DW_LN(dw, ln, phy) 	(_ICL_COMBOPHY(phy) + \
					  _ICL_PORT_TX_LN(ln) + 4 * (dw))
#define _ICL_PORT_TX_LN(ln)			(0x880 + (ln) * 0x100)
#define _ICL_PORT_TX_DW_AUX(dw, phy)		(_ICL_COMBOPHY(phy) + \
					 _ICL_PORT_TX_AUX + 4 * (dw))
#define _ICL_PORT_TX_DW_GRP(dw, phy)		(_ICL_COMBOPHY(phy) + \
					 _ICL_PORT_TX_GRP + 4 * (dw))
#define _ICL_PORT_TX_AUX			0x380
#define _ICL_PORT_TX_GRP			0x680
#define _ICL_PORT_TX_LN(ln)			(0x880 + (ln) * 0x100)
#define _ICL_PORT_PCS_AUX			0x300
#define _ICL_PORT_PCS_GRP			0x600
#define _ICL_PORT_PCS_LN(ln)			(0x800 + (ln) * 0x100)
#define _ICL_PORT_PCS_DW_AUX(dw, phy)		(_ICL_COMBOPHY(phy) + \
					 _ICL_PORT_PCS_AUX + 4 * (dw))
#define _ICL_PORT_PCS_DW_GRP(dw, phy)		(_ICL_COMBOPHY(phy) + \
					 _ICL_PORT_PCS_GRP + 4 * (dw))
#define _ICL_PORT_PCS_DW_LN(dw, ln, phy)	 (_ICL_COMBOPHY(phy) + \
					  _ICL_PORT_PCS_LN(ln) + 4 * (dw))
#define   IREFGEN				REG_BIT(24)
#define   COMP_INIT				REG_BIT(31)
#define _ICL_PORT_CL_DW(dw, phy)		(_ICL_COMBOPHY(phy) + \
					 4 * (dw))
#define ICL_PORT_COMP_DW9(phy)			_MMIO(_ICL_PORT_COMP_DW(9, phy))
#define ICL_PORT_COMP_DW10(phy)			_MMIO(_ICL_PORT_COMP_DW(10, phy))

#define  PWR_DOWN_LN_MASK			REG_GENMASK(7, 4)
#define  PWR_UP_ALL_LANES			REG_FIELD_PREP(PWR_DOWN_LN_MASK, 0x0)
#define  PWR_DOWN_LN_3_2_1			REG_FIELD_PREP(PWR_DOWN_LN_MASK, 0xe)
#define  PWR_DOWN_LN_3_2			REG_FIELD_PREP(PWR_DOWN_LN_MASK, 0xc)
#define  PWR_DOWN_LN_3				REG_FIELD_PREP(PWR_DOWN_LN_MASK, 0x8)
#define  PWR_DOWN_LN_2_1_0			REG_FIELD_PREP(PWR_DOWN_LN_MASK, 0x7)
#define  PWR_DOWN_LN_1_0			REG_FIELD_PREP(PWR_DOWN_LN_MASK, 0x3)
#define  PWR_DOWN_LN_3_1			REG_FIELD_PREP(PWR_DOWN_LN_MASK, 0xa)
#define  PWR_DOWN_LN_3_1_0			REG_FIELD_PREP(PWR_DOWN_LN_MASK, 0xb)

#define ICL_PORT_CL_DW10(phy)			_MMIO(_ICL_PORT_CL_DW(10, phy))

struct PACKED PortConfig {
	uint32_t index;
	uint32_t busId;
	uint32_t pipe;
	uint32_t pad;
	uint32_t type;
	uint32_t flags;
};

struct  PortDriveConfig {
	uint32_t Voltage;
	uint16_t value;
	uint16_t  flags;
};
struct PACKED LaneStatusMasks {
	uint16_t maskLane1;   // 0x000F
	uint16_t reserved1;   // 0x00FF
	uint16_t reserved2;   // 0xFF0F
	uint16_t maskLane4;   // 0xFFFF
	uint8_t  padding1[8];
	uint8_t  tableChecksum[16];
};
struct PACKED TGL_ComboPhy_Registers {
	uint32_t reg_phy_ctl_0;       uint32_t reg_phy_ctl_1;
	uint32_t reg_dpll_stat_0;     uint32_t reg_dpll_stat_1;
	uint32_t reg_phy_misc_0;      uint32_t reg_phy_misc_1;
	uint32_t reg_phy_misc_2_0;    uint32_t reg_phy_misc_2_1;
	uint32_t reg_phy_misc_3_0;    uint32_t reg_phy_misc_3_1;
	uint32_t reg_misc_4_0;        uint32_t reg_misc_4_1;
	uint32_t reg_port_ctl_0;      uint32_t reg_port_ctl_1;
	uint32_t reg_voltage_info;    uint32_t reg_voltage_info_2; // 0x5B8
	uint32_t reg_comp_ctl_0;      uint32_t reg_comp_ctl_1;     // 0x5C4
	uint32_t reg_ddi_buf_ctl_0;   uint32_t reg_ddi_buf_ctl_1;  // 0x5C8
	uint32_t reg_bias_ctl_0;      uint32_t reg_bias_ctl_1;     // 0x5D4
	uint32_t reg_pcs_ctl_0;       uint32_t reg_pcs_ctl_1;      // 0x5D8
	uint32_t reg_tx_dwell_0;      uint32_t reg_tx_dwell_1;
	uint32_t reg_pat_ctl_0;       uint32_t reg_pat_ctl_1;
	uint32_t reg_tx_lane_0;       uint32_t reg_tx_lane_1;      // 0x5F0
	uint32_t reg_tx_lane_2;       uint32_t reg_tx_lane_3;      // 0x5F8
	uint32_t reg_loadgen_0;       uint32_t reg_loadgen_1;      // 0x604
	uint32_t reg_common_ctl_0;    uint32_t reg_common_ctl_1;    // 0x608
	uint32_t reg_parity_0;        uint32_t reg_parity_1;
	uint32_t reg_idle_ctl_0;      uint32_t reg_idle_ctl_1;      // 0x61C
	uint32_t reg_aux_0;           uint32_t reg_aux_1;          // 0x620
	uint32_t reg_ln0_trans_0;     uint32_t reg_ln0_trans_1;
	uint32_t reg_ln1_trans_0;     uint32_t reg_ln1_trans_1;
	uint32_t reg_ln2_trans_0;     uint32_t reg_ln2_trans_1;
	uint32_t reg_ln3_trans_0;     uint32_t reg_ln3_trans_1;
	uint32_t reg_misc_phy_0;      uint32_t reg_misc_phy_1;
	uint32_t reg_fia_0;           uint32_t reg_fia_1;
	uint32_t reg_fia_2;           uint32_t reg_fia_3;
	uint32_t reg_fia_4;           uint32_t reg_fia_5;
	uint32_t reg_fia_6;           uint32_t reg_fia_7;
	uint32_t reg_fia_8;           uint32_t reg_fia_9;
	uint32_t reg_fia_10;          uint32_t reg_fia_11;
	uint32_t reg_fia_12;          uint32_t reg_fia_13;
	uint32_t reg_fia_14;          uint32_t reg_fia_15;
	uint32_t reg_fia_16;          uint32_t reg_fia_17;
	uint32_t reg_fia_18;          uint32_t reg_fia_19;
	uint32_t reg_fia_20;          uint32_t reg_fia_21;
};
const uint8_t fLinkTrainingDriveTable[16] = {
	0x00, 0x04, 0x07, 0x09,
	0x01, 0x05, 0x08, 0x09,
	0x02, 0x06, 0x08, 0x09,
	0x03, 0x06, 0x08, 0x09
};

const LaneStatusMasks gLaneStatusMasks = {
	0x000F, 0x00FF, 0xFF0F, 0xFFFF,
	{ 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 },
	{ 0xF1, 0xA1, 0xDD, 0x7C, 0xAC, 0x06, 0x4E, 0x78,
	  0x1F, 0xD6, 0x84, 0x38, 0x05, 0x2D, 0x6E, 0xB4 }
};

static const uint8_t gDPVcc0_85V[10][28]={
	// Level 0: (0,0)
	{ 0x90, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
	  0x98, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 },

	// Level 1: (1,0)
	{ 0x90, 0x01, 0x00, 0x00, 0x23, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x15, 0x30, 0x00, 0x00,
	  0x98, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 },

	// Level 2: (1,1)
	{ 0x90, 0x01, 0x00, 0x00, 0x3C, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x12, 0x60, 0x00, 0x00,
	  0x98, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 },

	// Level 3: (2,0)
	{ 0x90, 0x01, 0x00, 0x00, 0x5F, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x0F, 0x90, 0x00, 0x00,
	  0x98, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 },

	// Level 4: (2,1)
	{ 0x58, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0B, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
	  0x70, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 },

	// Level 5: (2,2)
	{ 0x58, 0x02, 0x00, 0x00, 0x23, 0x00, 0x00, 0x00, 0x0B, 0x00, 0x00, 0x00, 0x15, 0x30, 0x00, 0x00,
	  0x70, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 },

	// Level 6: (3,0)
	{ 0x58, 0x02, 0x00, 0x00, 0x3C, 0x00, 0x00, 0x00, 0x0B, 0x00, 0x00, 0x00, 0x12, 0x60, 0x00, 0x00,
	  0x70, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 },

	// Level 7: (3,1)
	{ 0x20, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x05, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
	  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 },

	// Level 8: (3,2)
	{ 0x20, 0x03, 0x00, 0x00, 0x23, 0x00, 0x00, 0x00, 0x05, 0x00, 0x00, 0x00, 0x15, 0x30, 0x00, 0x00,
	  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 },

	// Level 9: (3,3)
	{ 0xB0, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x06, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
	  0x98, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }
};


typedef unsigned char    byte;
#define DMC_DEFAULT_FW_OFFSET		0xFFFFFFFF
#define PACKAGE_MAX_FW_INFO_ENTRIES	20
#define PACKAGE_V2_MAX_FW_INFO_ENTRIES	32
#define DMC_V1_MAX_MMIO_COUNT		8
#define DMC_V3_MAX_MMIO_COUNT		20
#define DMC_V1_MMIO_START_RANGE		0x80000

struct PACKED intel_css_header
{
	uint32_t module_type;
	uint32_t header_len;
	uint32_t header_ver;
	uint32_t module_id;
	uint32_t module_vendor;
	uint32_t date;
	uint32_t size;
	uint32_t key_size;
	uint32_t modulus_size;
	uint32_t exponent_size;
	uint32_t reserved1[0xc];
	uint32_t version;
	uint32_t reserved2[0x8];
	uint32_t kernel_header_info;
};

struct PACKED intel_package_header
{
	uint8_t header_len;
	uint8_t header_ver;
	uint8_t reserved[0xa];
	uint32_t num_entries;
};

struct PACKED intel_fw_info
{
	uint8_t reserved1;
	uint8_t dmc_id;
	char stepping;
	char substepping;
	uint32_t offset;
	uint32_t reserved2;
};


struct PACKED intel_dmc_header_base {
	uint32_t signature;

	uint8_t header_len;

	uint8_t header_ver;

	uint16_t dmcc_ver;

	uint32_t project;

	uint32_t fw_size;

	uint32_t fw_version;
};

struct PACKED intel_dmc_header_v1 {
	struct intel_dmc_header_base base;

	uint32_t mmio_count;

	uint32_t mmioaddr[DMC_V1_MAX_MMIO_COUNT];

	uint32_t mmiodata[DMC_V1_MAX_MMIO_COUNT];

	char dfile[32];

	uint32_t reserved1[2];
};

struct PACKED intel_dmc_header_v3 {
	struct intel_dmc_header_base base;

	uint32_t start_mmioaddr;

	uint32_t reserved[9];

	char dfile[32];

	uint32_t mmio_count;

	uint32_t mmioaddr[DMC_V3_MAX_MMIO_COUNT];

	uint32_t mmiodata[DMC_V3_MAX_MMIO_COUNT];
};

struct PACKED DPCD_BranchOuiData {
	/* DPCD 0x400 - 0x402: Intel OUI (00:10:FA) */
	byte oui_0;          // local_51: Expected 0x00
	byte oui_1;          // local_50: Expected 0x10
	byte oui_2;          // local_4f: Expected 0xFA (-6 as signed char)

	/* DPCD 0x403 - 0x408: Vendor Specific Data / Panel ID */
	byte panel_char_1;   // local_4e: Expected 'e'
	byte panel_char_2;   // local_4d: Expected 'D'
	byte panel_hex_byte; // local_4c: Printed as <0x%02x>
	byte panel_char_3;   // local_4b: Expected 'f' (BanksiaL) or 'g' (Banksia)
	byte panel_char_4;   // local_4a
	byte panel_char_5;   // local_49
} ;

struct PACKED crtparams
{
	int32_t TRANS_CLK_SEL;
	int32_t TRANS_DDI_FUNC_CTL;
	int32_t TRANS_DDI_FUNC_CTL2;
	int32_t TRANS_MSA_MISC;
	int32_t TRANS_HTOTAL;
	int32_t TRANS_HBLANK;
	int32_t TRANS_HSYNC;
	int32_t TRANS_VTOTAL;
	int32_t TRANS_VBLANK;
	int32_t TRANS_VSYNC;
	int32_t PIPE_SRCSZ;
	int32_t TRANS_CONF;
	int32_t PIPE_MISC;
	int32_t TRANS_VSYNCSHIFT;
	int32_t TRANS_DATAM1;
	 char _3c[4];
	int32_t TRANS_LINKM1;
	 char _44[8];
	int32_t field_4c;
	int32_t field_50;
};

#define POPCOUNT(x) ({ \
	uint32_t _v = (x); \
	uint32_t _c = 0; \
	while (_v) { \
		_c++; \
		_v &= _v - 1; \
	} \
	_c; \
})
struct PACKED VoltageConfig {
	uint64_t pad;
	uint8_t* voltageData;
};

struct AGDCFBOnline_t {
	int32_t                 id;
	uint32_t                state;
};

enum ConnectorType : uint32_t {
	ConnectorZero       = 0x0,
	ConnectorDummy      = 0x1,
	ConnectorLVDS       = 0x2,
	ConnectorDigitalDVI = 0x4,
	ConnectorSVID       = 0x8,
	ConnectorVGA        = 0x10,
	ConnectorDP         = 0x400,
	ConnectorHDMI       = 0x800,
	ConnectorAnalogDVI  = 0x2000
};


union ConnectorFlags {
	struct PACKED ConnectorFlagBits {
		/* 0x1 */
		/* Lets aperture memory to be not required AppleIntelFramebuffer::isApertureMemoryRequired */
		uint8_t CNAlterAppertureRequirements :1;  /* 0x1 */
		
		/* 0x2 - Fixed Name */
		/* Commonly indicates a secondary port or auxiliary connector. */
		uint8_t CNFlagSecondary             :1;  /* 0x2 */
		
		/* 0x4 - Fixed Name */
		/* Forces the driver to assume an EDID is present or validate strictly. */
		uint8_t CNFlagForceEDID             :1;  /* 0x4 */
		
		/* 0x8 */
		/* Normally set for LVDS displays (i.e. built-in displays) */
		uint8_t CNConnectorAlwaysConnected   :1;  /* 0x8 */
		
		/* 0x10 - Fixed Name */
		/* AppleIntelFramebuffer::maxSupportedDepths checks this and returns 2 IODisplayModeInformation::maxDepthIndex.
		 * This enables 32-bit color depth support (High Color). */
		uint8_t CNSupport32BPP              :1;  /* 0x10 */
		
		/* 0x20 - Fixed Name */
		/* Often indicates legacy port or specific audio enablement requirements on older generations. */
		uint8_t CNFlagLegacy                :1;  /* 0x20 */
		
		/* 0x40 */
		/* Disable blit translation table? AppleIntelFramebufferController::ConfigureBufferTranslation */
		uint8_t CNDisableBlitTranslationTable:1;  /* 0x40 */
		
		/* 0x80 */
		/* Used in AppleIntelFramebufferController::setPowerWellState */
		/* Activates MISC IO power well (SKL_DISP_PW_MISC_IO) */
		uint8_t CNUseMiscIoPowerWell        :1;  /* 0x80 */
		
		/* 0x100 */
		/* Used in AppleIntelFramebufferController::setPowerWellState */
		/* Activates Power Well 2 usage (SKL_PW_CTL_IDX_PW_2) */
		uint8_t CNUsePowerWell2             :1;  /* 0x100 */
		
		/* 0x200 - Fixed Name */
		/* Detected in patchConnectorType logic. Indicates HDMI connector type. */
		uint8_t CNFlagHDMI                  :1;  /* 0x200 */
		
		/* 0x400 - Fixed Name */
		/* Detected in patchConnectorType logic. Indicates DisplayPort connector type. */
		uint8_t CNFlagDP                    :1;  /* 0x400 */
		
		/* 0x800 */
		/* Sets fAvailableLaneCount to 30 instead of 20 when specified. Required for 4K resolutions. */
		uint8_t CNIncreaseLaneCount         :1;  /* 0x800 */
		
		/* 0x1000 - Fixed Name */
		/* Commonly associated with Dual-Link DVI or high-bandwidth modes. */
		uint8_t CNFlagDualLink              :1;  /* 0x1000 */
		
		/* 0x2000 - Fixed Name */
		/* Often set for ports that require specific hot-plug handling or are defined as "Internal" on newer platforms. */
		uint8_t CNFlagInternalOverride      :1;  /* 0x2000 */
		
		/* 0x4000 - Fixed Name */
		/* Sometimes associated with specific encoder types (e.g., FDI or specific Transcoder links). */
		uint8_t CNFlagEncoderSpecific       :1;  /* 0x4000 */
		
		/* 0x8000 - Fixed Name */
		/* Indicates that Hot Plug Detect (HPD) is not connected or should be ignored. */
		uint8_t CNFlagNoHPD                 :1;  /* 0x8000 */
		
		uint16_t CNUnknownZeroFlags;
	} bits;
	uint32_t value;
};


struct PACKED ConnectorEntry {
	uint32_t index;
	uint32_t busId;
	uint32_t pipe;
	uint32_t pad;
	uint32_t type;
	uint32_t flags;
};

struct PACKED PlatformInfo {

		uint32_t fInfoPlatformID;
		uint32_t fPchType;
		uint64_t* fModelNameAddr;
		uint8_t fMobile;
		uint8_t fPipeCount;
		uint8_t fInfoPortCount;
		uint8_t fInfoFramebufferCount;
		uint32_t fInfoFramebufferMemorySize;
		uint32_t fInfoFBCompressionMemorySize;
		uint32_t fUnifiedMemorySize;
		struct ConnectorEntry connectors[0x9];
		uint32_t fInfoFlags;
		uint32_t pad0;
		struct VoltageConfig voltages[0x9];
		uint32_t cameliav;
		uint32_t MCLK;
		uint32_t VCLK;
		uint32_t TCONfbindex;
		uint32_t BeaconLoc;
		uint32_t MinFrmTim;
		uint32_t MaxFrmTim;
		uint32_t fInfoDynamicFBCThreshold;
		uint32_t fVideoTurboFreq;
		uint32_t fSliceCount;
		uint32_t fmaxEuCount;
		uint32_t fsubslices;

};

union FramebufferFlags {
	struct FramebufferFlagBits {
		/* Discovered in AppleIntelFBController::LinkTraining. Disables the use of FastLinkTraining.
		 * According to joevt with zero SKL link training happens at 450 MHz else at 540 MHz */
		uint8_t FBAvoidFastLinkTraining      :1;  /* 0x1 */
		uint8_t FBUnknownFlag_2              :1;  /* 0x2 */
		/* Discovered in AppleIntelFramebufferController::getFeatureControl.
		 * This is equivalent to setting FBC=1 in the plist FeatureControl section. */
		uint8_t FBFramebufferCompression     :1;  /* 0x4 */
		/* Discovered in AppleIntelFramebufferController::getFeatureControl.
		 * This is equivalent to setting SliceSDEnable=1, EUSDEnable=1, DynamicSliceSwitch=1 in the plist FeatureControl section.
		 */
		uint8_t FBEnableSliceFeatures        :1;  /* 0x8 */
		/* Discovered in AppleIntelFramebufferController::getFeatureControl.
		 * This is equivalent to setting DynamicFBCEnable=1 in the plist FeatureControl section.
		 */
		uint8_t FBDynamicFBCEnable           :1;  /* 0x10 */
		/* This sets fUseVideoTurbo=1 and loads GPU turbo frequency from the specific field.
		 * Defaults to 14, can be overridden by VideoTurboFreq in the plist FeatureControl section.
		 */
		uint8_t FBUseVideoTurbo              :1;  /* 0x20 */
		/* Discovered in AppleIntelFramebuffer::getDisplayStatus.
		 * Enforces display power reset even on always connected displays (see connector flags CNConnectorAlwaysConnected).
		 */
		uint8_t FBForcePowerAlwaysConnected  :1;  /* 0x40 */
		/* According to joevt this enforces High Bitrate mode 1, which limits DP bitrate to 8.64 Gbit/s instead of normal 17.28 Gbit/s (HBR2).
		 * I do not think this is used on Skylake any longer.
		 */
		uint8_t FBDisableHighBitrateMode2    :1;  /* 0x80 */
		/* This bit is not used on Broadwell and newer but set when fPortCount > 0, i.e. for all online framebuffers.
		 * On Haswell it is used by AppleIntelFramebuffer::GetOnlineInfo and is set only on 0x0D260007 (MacBookPro11,3) and 0x0D26000E, which are top models.
		 * This appears to boost pixel frequency limit (aka pixel clock) to 540000000 Hz (from the usual 216000000, 320000000, 360000000, 450000000).
		 */
		uint8_t FBBoostPixelFrequencyLimit   :1;  /* 0x100 */
		/* Discovered in AppleIntelFramebuffer::ValidateSourceSize.
		 * Limits source size to 4096x4096.
		 */
		uint8_t FBLimit4KSourceSize          :1;  /* 0x200 */
		/* Discovered in AppleIntelFramebufferController::start.
		 * These bits appear to be entirely equivalent and could be used interchangeably. Result in setting:
		 * - PCH_LP_PARTITION_LEVEL_DISABLE (1 << 12) bit in SOUTH_DSPCLK_GATE_D (0xc2020)
		 * - LPT_PWM_GRANULARITY (1 << 5) bit in SOUTH_CHICKEN2 (0xc2004)
		 * See Linux driver sources (lpt_init_clock_gating, lpt_enable_backlight).
		 * Since these bits are setting backlight pulse width modularity, there is no sense in setting them without a built-in display (i.e. on desktop).
		 */
		uint8_t FBAlternatePWMIncrement1     :1;  /* 0x400 */
		uint8_t FBAlternatePWMIncrement2     :1;  /* 0x800 */
		/* Discovered in Broadwell AppleIntelFBController::start / AppleIntelFBController::getFeatureControl.
		 * This is equivalent to setting DisableFeatureIPS=1 in the plist FeatureControl section.
		 * IPS stands for Intermediate Pixel Storage
		 */
		uint8_t FBDisableFeatureIPS          :1;  /* 0x1000 */
		uint8_t FBUnknownFlag_2000           :1;  /* 0x2000 */
		/* Discovered in Broadwell AppleIntelFBController::getOSInformation.
		 * Used by AppleIntelFramebufferController::LinkTraining for camellia version 2.
		 * Can be overridden by -notconrecover boot-arg, which effectively unsets this bit.
		 */
		uint8_t FBAllowConnectorRecover      :1;  /* 0x4000 */
		uint8_t FBUnknownFlag_8000           :1;  /* 0x8000 */
		uint8_t FBUnknownFlag_10000          :1;  /* 0x10000 */
		uint8_t FBUnknownFlag_20000          :1;  /* 0x20000 */
		/* Discovered in AppleIntelFramebufferController::getFeatureControl.
		 * This takes its effect only if GFMPPFM in the plist FeatureControl section is set to 2, otherwise GFMPPFM is off.
		 */
		uint8_t FBDisableGFMPPFM             :1;  /* 0x40000 */
		uint8_t FBUnknownFlag_80000          :1;  /* 0x80000 */
		uint8_t FBUnknownFlag_100000         :1;  /* 0x100000 */
		/* Discovered in AppleIntelFramebufferController::getFeatureControl.
		 * This takes its effect only if SupportDynamicCDClk in the plist FeatureControl section is set to 1, otherwise off.
		 * Also requires dc6config to be set to 3 (default).
		 */
		uint8_t FBEnableDynamicCDCLK         :1;  /* 0x200000 */
		uint8_t FBUnknownFlag_400000         :1;  /* 0x400000 */
		/* Discovered in AppleIntelFramebuffer::enableController.
		 * Used by AppleIntelFramebuffer::ValidateSourceSize.
		 * Setting this bit increases the maximum source size from 4096x4096 to 5120x5120.
		 * Most likely this enables 5K support via Intel HD.
		 */
		uint8_t FBSupport5KSourceSize        :1;  /* 0x800000 */
		uint8_t FBUknownZeroFlags;
	} bits;
	uint32_t value;
};


enum FramebufferFlags2
{
	
	// 0x1
	FB_FLAG_AVOID_FAST_LINK_TRAINING = 0x1,

	// 0x2 (Context: fInfoFlags[2])
	// Used to force backlight control via CPU registers rather than standard PWM
	FB_FLAG_ENABLE_BACKLIGHT_REG_CONTROL = 0x2,

	// 0x4
	FB_FLAG_FRAMEBUFFER_COMPRESSION = 0x4,

	// 0x8
	FB_FLAG_ENABLE_SLICE_FEATURES = 0x8,

	// 0x10
	FB_FLAG_DYNAMIC_FBC_ENABLE = 0x10,

	// 0x20
	FB_FLAG_USE_VIDEO_TURBO = 0x20,

	// 0x40
	FB_FLAG_FORCE_POWER_ALWAYS_CONNECTED = 0x40,

	// 0x80
	FB_FLAG_DISABLE_HIGH_BITRATE_MODE2 = 0x80,

	// 0x100
	FB_FLAG_BOOST_PIXEL_FREQUENCY_LIMIT = 0x100,

	// 0x200
	FB_FLAG_LIMIT_4K_SOURCE_SIZE = 0x200,

	// 0x400
	FB_FLAG_ALTERNATE_PWM_INCREMENT1 = 0x400,

	// 0x800
	FB_FLAG_ALTERNATE_PWM_INCREMENT2 = 0x800,

	// 0x1000
	FB_FLAG_DISABLE_FEATURE_IPS = 0x1000,

	// 0x2000 (Formerly UNKNOWN_2000)
